<?php

$args = [
    'post_type'      => 'services',
    'posts_per_page' => 4,
    'orderby'        => 'date',
    'order'          => 'DESC',
];

$services_query = new WP_Query($args);
?>

<div class="services2">
    <div class="container">
        <div class="head-services2">
            <h4>خدماتنا</h4>
            <p>المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار للنص الشكلي منذ القرن الخامس عشر عندماهو ببساطة نص
                شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات </p>
        </div>
        <div class="services2-cards">
            <?php if ($services_query->have_posts()) : ?>
            <?php while ($services_query->have_posts()) : $services_query->the_post(); ?>
            <?php
            $svg_icon = get_post_meta(get_the_ID(), '_cob_service_svg', true);
            ?>
            <div class="services2-card">
                <ul>
                    <li>
                        <div class="icon-holder">
                            <?php if (!empty($svg_icon)) : ?>
                                <?php echo $svg_icon;?>
                            <?php else : ?>
                            <svg width="34" height="25" viewBox="0 0 34 25" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M18.0062 6.69728C19.6085 5.17441 21.2089 3.64886 22.8149 2.12955C23.6466 1.34185 24.0528 1.33562 24.8891 2.13489C27.5234 4.65284 30.1401 7.1877 32.7828 9.69764C33.2733 10.1631 33.4717 10.6687 33.4643 11.3247C33.4383 13.6121 33.455 15.8995 33.4541 18.186C33.4532 19.5327 33.3132 19.6724 31.9427 19.6733C28.765 19.676 25.5864 19.6849 22.4088 19.6662C21.7059 19.6618 21.1199 19.8335 20.5663 20.2599C18.9557 21.5006 17.3191 22.7102 15.6909 23.9295C15.3663 24.1725 15.0539 24.4645 14.5828 24.25C14.0951 24.0274 14.198 23.5984 14.1906 23.213C14.1702 22.0248 14.1554 20.8366 14.1387 19.6484C14.1517 16.8821 14.1795 14.1167 14.1665 11.3505C14.1637 10.6918 14.3705 10.1898 14.861 9.73324C15.9283 8.74084 16.9603 7.71194 18.0062 6.69728Z"
                                    fill="#FD6B22" />
                                <path
                                    d="M16.2483 5.84099C15.2023 6.85565 14.1703 7.88454 13.1031 8.87873C12.6125 9.33533 12.4058 9.83731 12.4086 10.496C12.4215 13.2613 12.3937 16.0276 12.3807 18.7939C8.88595 18.7948 5.39024 18.7974 1.89546 18.7948C0.727133 18.7939 0.564865 18.639 0.563011 17.5318C0.559302 15.183 0.578774 12.835 0.550956 10.4879C0.543538 9.82485 0.77164 9.3291 1.25566 8.86894C3.87327 6.37947 6.47141 3.86953 9.07975 1.37116C10.019 0.47221 10.3584 0.46954 11.2829 1.35069C12.6357 2.64037 13.9793 3.93806 15.3284 5.23042C15.5964 5.48586 15.8301 5.79204 16.2483 5.84099Z"
                                    fill="#FD6B22" />
                            </svg>
                            <?php endif; ?>
                        </div>
                    </li>
                    <li>
                        <h6><?php the_title(); ?></h6>
                    </li>
                    <li>
                        <p><?php echo get_the_excerpt(); ?></p>
                    </li>
                </ul>
            </div>
                <?php endwhile; ?>
                <?php wp_reset_postdata(); ?>
            <?php else : ?>
                <p>لا توجد خدمات متاحة حالياً.</p>
            <?php endif; ?>

        </div>
    </div>
</div>