Repository: waleedelsefy/cob
Catalog: languages/*.po
Languages: ar

source: Quick links
ar: روابط سريعة

source: Top Areas
ar: افضل المناطق

source: Latest Projects
ar: أحدث المشروعات

source: Developers
ar: المطورين

source: Subscribe to the newsletter
ar: اشترك في النشرة الإخبارية

source: Subscribe now to receive the latest news and exclusive offers
ar: اشترك الآن للحصول على آخر الأخبار والعروض الحصرية

source: Subscribe
ar: اشترك

source: All rights reserved ©
ar: جميع الحقوق محفوظة ©

source: privacy policy
ar: سياسة الخصوصية

source: terms of use
ar: شروط الاستخدام

source: Arabic
ar: العربية

source: English
ar: الانجليزية

source: Toggle navigation
ar: تبديل التنقل

source: Primary Menu
ar: القائمة الأساسية

source: Call us
ar: اتصل بنا

source: No projects found.
ar: لم يتم العثور على مشاريع.

source: Previous
ar: السابق

source: Next
ar: التالي

source: There are no posts currently available
ar: لا توجد مشاركات متاحة حاليا

source: Invalid input
ar: إدخال غير صالح

source: Zoom API error
ar: خطأ في Zoom API

source: Your Zoom Meeting Details
ar: تفاصيل اجتماع Zoom الخاص بك

source: Join URL:
ar: رابط الانضمام:

source: Password:
ar: كلمة المرور:

source: Failed to obtain token
ar: فشل في الحصول على الرمز

source: Zoom Meetings
ar: اجتماعات زووم

source: Meeting canceled.
ar: تم إلغاء الاجتماع.

source: Topic
ar: عنوان

source: Start Time
ar: وقت البدء

source: Participant
ar: مشارك

source: Actions
ar: الإجراءات

source: Join
ar: الانضمام

source: Are you sure you want to cancel this meeting?
ar: هل أنت متأكد أنك تريد إلغاء هذا الاجتماع؟

source: Cancel
ar: الغاء

source: There are no posts currently available.
ar: لا توجد مشاركات متاحة حاليًا.

source: Contact Entries
ar: مدخلات الاتصال

source: Name
ar: الاسم

source: Phone
ar: الهاتف

source: Email
ar: البريد إلكتروني

source: Message
ar: رسالتك

source: Date
ar: التاريخ

source: No entries found
ar: لا يوجد مدخلات

source: Security check failed.
ar: فشل فحص الأمان.

source: Please fill in all required fields.
ar: يرجى ملء كافة الحقول المطلوبة.

source: An error occurred. Please try again later.
ar: حدث خطأ. يرجى المحاولة مرة أخرى لاحقا.

source: Your message has been sent successfully!
ar: لقد تم إرسال رسالتك بنجاح!

source: Full Name
ar: الاسم الكامل

source: Mobile Number
ar: رقم الهاتف المحمول

source: Email Address
ar: عنوان البريد الإلكتروني

source: Example: Enter your message here
ar: مثال: أدخل رسالتك هنا

source: Send
ar: ارسال

source: An unexpected error occurred.
ar: حدث خطأ غير متوقع.

source: Job Qualifications
ar: المؤهلات الوظيفية

source: Remove
ar: حذف

source: Add Qualification
ar: أضف المؤهل

source: Parent Project
ar: الكمبوند الاساسي

source: Select Parent Project:
ar: حدد الكمبوند:

source: -- None --
ar: -- لا أحد --

source: Compound
ar: الكمبوند

source: None
ar: لا أحد

source: -- No Change --
ar: -- لا تغيير --

source: Job Applicants
ar: المتقدمين للوظيفة

source: Status updated successfully.
ar: تم تحديث الحالة بنجاح.

source: Job ID
ar: الرقم المرجعي للوظيفة

source: Resume
ar: سيرة ذاتية

source: Additional Details
ar: تفاصيل إضافية

source: Submission Date
ar: تاريخ التقديم

source: Status
ar: الحالة

source: Action
ar: الاجراء

source: Download
ar: تحميل

source: N/A
ar: لا يوجد

source: Pending
ar: قيد الانتظار

source: Approved
ar: موافقة

source: Rejected
ar: مرفوض

source: Update
ar: تحديث

source: No applicants found.
ar: لم يتم العثور على المتقدمين.

# taxonomy general name
source: Job Tags
ar: العلامات الوظيفية

# taxonomy singular name
source: Job Tag
ar: علامة الوظيفة

source: Search Job Tags
ar: البحث عن العلامات الوظيفية

source: Popular Job Tags
ar: العلامات الوظيفية المشهورة

source: All Job Tags
ar: جميع العلامات الوظيفية

source: Edit Job Tag
ar: تحرير علامة الوظيفة

source: Update Job Tag
ar: تحديث علامة الوظيفة

source: Add New Job Tag
ar: إضافة علامة وظيفة جديدة

source: New Job Tag Name
ar: اسم علامة الوظيفة الجديدة

source: Separate job tags with commas
ar: علامات مهمة منفصلة بفواصل

source: Add or remove job tags
ar: إضافة أو إزالة علامات الوظيفة

source: Choose from the most used job tags
ar: اختر من بين علامات الوظائف الأكثر استخدامًا

source: No job tags found.
ar: لم يتم العثور على علامات الوظيفة.

source: Job Tags
ar: العلامات الوظيفية

# Post Type General Name
source: Jobs
ar: وظائف

# Post Type Singular Name
source: Job
ar: وظيفة

source: Jobs
ar: وظائف

source: Job
ar: وظيفة

source: Job Archives
ar: أرشيف الوظائف

source: Job Attributes
ar: تفاصيل الوظيفة

source: Parent Job:
ar: الوظيفة الأساسية :

source: All Jobs
ar: جميع الوظائف

source: Add New Job
ar: إضافة وظيفة جديدة

source: Add New
ar: اضف جديد

source: New Job
ar: وظيفة جديدة

source: Edit Job
ar: تحرير الوظيفة

source: Update Job
ar: تحديث الوظيفة

source: View Job
ar: عرض الوظيفة

source: View Jobs
ar: عرض الوظائف

source: Search Job
ar: بحث عن وظيفة

source: Not found
ar: لم يتم العثور عليه

source: Not found in Trash
ar: لم يتم العثور عليه في سلة المهملات

source: Featured Image
ar: صورة مميزة

source: Set featured image
ar: تعيين الصورة المميزة

source: Remove featured image
ar: إزالة الصورة المميزة

source: Use as featured image
ar: استخدم كصورة مميزة

source: Insert into job
ar: أدخل في الوظيفة

source: Uploaded to this job
ar: تم الرفع إلى هذه الوظيفة

source: Jobs list
ar: قائمة الوظائف

source: Jobs list navigation
ar: التنقل في قائمة الوظائف

source: Filter jobs list
ar: تصفية قائمة الوظائف

source: Job listings for the site
ar: قوائم الوظائف للموقع

source: Verification failed, please try again.
ar: فشل التحقق، يرجى المحاولة مرة أخرى.

source: !Thank you for applying for the job
ar: !شكرًا لك على التقدم للوظيفة

source: An error occurred while saving your request, please try again.
ar: حدث خطأ أثناء حفظ طلبك، يرجى المحاولة مرة أخرى.

source: Select Developer
ar: حدد المطور

source: Select City
ar: اختر المدينة

source: Custom Fields
ar: الحقول المخصصة

source: Developer
ar: مطور

source: City
ar: مدينة

source: Gallery Images
ar: معرض الصور

source: Add Images
ar: إضافة الصور

source: Select Images
ar: حدد الصور

source: Attach Images
ar: إرفاق الصور

source: Description
ar: الوصف

source: The description is not prominent by default, but some themes may show it.
ar: الوصف ليس بارزًا بشكل افتراضي، ولكن قد تظهره بعض السمات.

source: Compounds
ar: كمبوندات

source: Search Compounds
ar: البحث في الكمبوندات

source: All Compounds
ar: كل الكمبوندات

source: Parent Compound
ar: الكمبوند الاب

source: Parent Compound:
ar: الكمبوند الاب

source: Edit Compound
ar: تحرير كمبوند

source: Update Compound
ar: تحديث الكمبوند

source: Add New Compound
ar: إضافة كبموند جديد

source: New Compound Name
ar: اسم الكمبوند الجديد

source: Properties
ar: العقارات

source: Property
ar: عقار

source: Add New Property
ar: إضافة عقار جديد

source: Edit Property
ar: تحرير العقار

source: New Property
ar: عقار جديد

source: View Property
ar: عرض العقار

source: All Properties
ar: جميع العقارات

source: Search Properties
ar: البحث عن العقارات

source: No properties found.
ar: لم يتم العثور على خصائص.

source: Factories
ar: المصانع

source: Factory
ar: مصنع

source: Add New Factory
ar: إضافة مصنع جديد

source: Edit Factory
ar: تحرير المصنع

source: New Factory
ar: مصنع جديد

source: View Factory
ar: عرض المصنع

source: All Factories
ar: كل المصانع

source: Search Factories
ar: بحث عن مصنع

source: No factories found.
ar: المصنع غير موجود.

source: Lands
ar: الاراضي

source: Land
ar: ارض

source: Add New Land
ar: اضف ارض جديد

source: Edit Land
ar: تحرير ارض

source: New Land
ar: أرض جديدة

source: View Land
ar: عرض الارض

source: All Lands
ar: كل الأراضي

source: Search Lands
ar: البحث في الأراضي

source: No lands found.
ar: لم يتم العثور علي أراضي.

source: Cities
ar: المدن

source: Search Cities
ar: البحث في المدن

source: All Cities
ar: كل المدن

source: Parent City
ar: المدينة الأم

source: Parent City:
ar: المدينة الأم:

source: Edit City
ar: تحرير المدينة

source: View City
ar: شاهد المدينة

source: Update City
ar: تحديث المدينة

source: Add New City
ar: اصافة مدينة جديدة

source: New City Name
ar: اسم المدينة الجديد

source: Separate cities with commas
ar: افصل بين المدن بفواصل

source: Search Developers
ar: بحث المطورين

source: All Developers
ar: كل المطورين

source: Parent Developer
ar: المطور الاب

source: Parent Developer:
ar: المطور الاب :

source: Edit Developer
ar: تحرير المطور

source: View Developer
ar: عرض المطور

source: Update Developer
ar: تحديث المطور

source: Add New Developer
ar: إضافة مطور جديد

source: New Developer Name
ar: اسم المطور الجديد

source: Separate Developers with commas
ar: فصل المطورين بفواصل

source: Finishing Types
ar: أنواع التشطيب

source: Finishing Type
ar: نوع التشطيب

source: Search Finishing Types
ar: البحث عن أنواع التشطيب

source: All Finishing Types
ar: جميع أنواع التشطيب

source: Edit Finishing Type
ar: تحرير نوع التشطيب

source: View Finishing Type
ar: عرض نوع التشطيب

source: Update Finishing Type
ar: تحديث نوع التشطيب

source: Add New Finishing Type
ar: إضافة نوع تشطيب جديد

source: New Finishing Type Name
ar: اسم نوع التشطيب الجديد

source: Separate Finishing Types with commas
ar: أنواع التشطيب المنفصلة باستخدام الفواصل

source: Types
ar: الأنواع

source: Type
ar: نوع

source: Services
ar: الخدمات

source: Service
ar: الخدمة

source: Add New Service
ar: إضافة خدمة جديدة

source: Edit Service
ar: تحرير الخدمة

source: New Service
ar: خدمة جديدة

source: View Service
ar: عرض الخدمة

source: Search Services
ar: خدمات البحث

source: No Services found.
ar: لم يتم العثور على أي خدمات.

source: Service SVG Icon
ar: أيقونة الخدمة SVG

source: Insert SVG Code:
ar: أدخل كود SVG:

source: Paste valid SVG code including <svg> tags. Example:
ar: الصق رمز SVG صالحًا يتضمن &lt;svg&gt; العلامات. مثال:

source: Sliders
ar: السلايدرات

source: Slider
ar: السلايدر

source: Add New Slider
ar: اصافة سلايدر جديدة

source: Edit Slider
ar: تعديل السلايدر

source: New Slider
ar: سلايدر جديد

source: View Slider
ar: مشاهدة السلايدر

source: All Sliders
ar: كل السلايدرات

source: Search Sliders
ar: البحث في السلايدر

source: No Sliders found.
ar: لم يتم العثور علي سلايدر.

source: Real Estate Expert
ar: خبير عقاري

source: Real Estate Expert Information
ar: معلومات الخبراء العقاريين

source: Phone Number
ar: رقم التليفون

source: Enter your phone number.
ar: أدخل رقم هاتفك.

source: Job Title
ar: مسمى وظيفي

source: Enter your Job Title.
ar: أدخل المسمى الوظيفي الخاص بك.

source: Profile Image
ar: صورة الملف الشخصي

source: Enter the URL of your profile image.
ar: أدخل عنوان URL لصورة ملفك الشخصي.

source: Appearance Settings
ar: إعدادات المظهر

source: Customize the site appearance.
ar: تخصيص مظهر الموقع.

source: Footer Settings
ar: إعدادات التذييل

source: Footer Text
ar: نص حقوق النشر في الفوتر

source: © 2024 Capital of Business. All rights reserved.
ar: © 2024 كابيتال أوف بيزنس. جميع الحقوق محفوظة.

source: Header Settings
ar: اعدادت الترويسة

source: Header Background
ar: خلفية الترويسة

source: Sticky Header
ar: الهيدر الستيكي

source: Typography
ar: الطباعة

source: Body Font
ar: الخط

source: General Settings
ar: الاعدادت الاساسية

source: Manage general theme options.
ar: إدارة خيارات القالب العامة .

source: Site Logo
ar: شعار الموقع

source: Upload your site logo.
ar: قم بتحميل شعار موقعك.

source: Favicon
ar: الرمز المفضل

source: Upload a 32x32px favicon.
ar: قم بتحميل أيقونة مفضلة بحجم 32 × 32 بكسل.

source: Property Settings
ar: إعدادات الملكية

source: Manage real estate property options.
ar: إدارة خيارات الملكية العقارية.

source: Default Property Image
ar: صورة الخاصية الافتراضية

source: Upload a fallback image for properties.
ar: قم بتحميل صورة احتياطية للخصائص.

source: Listing Layout
ar: تخطيط القائمة

source: Choose the layout for property listings.
ar: اختر التخطيط لقوائم العقارات.

source: Social Media
ar: وسائل التواصل الاجتماعي

source: Enable Social Menu
ar: تمكين القائمة الاجتماعية

source: Social Media Links
ar: روابط وسائل التواصل الاجتماعي

source: Add social media links. Use the format: platform|URL
ar: إضافة روابط وسائل التواصل الاجتماعي. استخدم التنسيق: النظام الأساسي|URL

source: City Image
ar: صورة المدينة

source: Upload Image
ar: ارفع صورة

source: Remove Image
ar: حذف الصورة

source: Enter the URL of the city image or use the "Upload Image" button.
ar: أدخل عنوان URL لصورة المدينة أو استخدم زر "تحميل الصورة".

source: Select or Upload Image
ar: حدد أو قم بتحميل الصورة

source: Use this image
ar: استخدم هذه الصورة

source: Image
ar: صورة

source: Compound Cover Image
ar: صورة الكمبوند

source: Upload/Select Image
ar: ارفع صورة / اختر صورة

source: Select the main cover image for this compound.
ar: قم باختيار صورة الغلاف الرئيسية لهذا المركب.

source: Choose Compound Cover Image
ar: اختر صورة للكمبوند

source: Cover Image
ar: صورة الغلاف

source: Error loading developer
ar: حدث خطأ أثناء تحميل المطور

source: Error loading city
ar: حدث خطأ أثناء تحميل المدينة

source: Merge Duplicate Compounds
ar: دمج الكمبوندات المكررة

source: Merge Compounds
ar: دمج الكمبوندات

source: WARNING:
ar: تحذير:

source: This tool will make permanent changes to your database by reassigning posts and deleting taxonomy terms. It is crucial to have a complete backup of your website (files and database) before proceeding. Test on a staging environment first if possible.
ar: ستُجري هذه الأداة تغييرات دائمة على قاعدة بياناتك بإعادة تعيين المنشورات وحذف مصطلحات التصنيف. من الضروري الاحتفاظ بنسخة احتياطية كاملة لموقعك الإلكتروني (الملفات وقاعدة البيانات) قبل المتابعة. اختبرها على بيئة تجريبية أولًا إن أمكن.

source: This tool will scan the "%s" taxonomy for terms that have the exact same name and attempt to merge them.
ar: ستقوم هذه الأداة بمسح تصنيف "%s" بحثًا عن المصطلحات التي تحمل الاسم نفسه تمامًا ومحاولة دمجها.

source: For each group of duplicate-named terms, one term will be chosen as the "primary" term (usually the oldest or one with a cover image). Posts will be reassigned to this primary term, and the cover image (meta key: %s) will be transferred if the primary term doesn_t have one. Other duplicate terms will then be deleted.
ar: لكل مجموعة من المصطلحات ذات الأسماء المكررة، سيتم اختيار مصطلح واحد ليكون المصطلح "الأساسي" (عادةً الأقدم أو الذي يحمل صورة غلاف). ستُعاد تخصيص المنشورات لهذا المصطلح الأساسي، وسيتم نقل صورة الغلاف (مفتاح التعريف: %s) إذا لم يكن للمصطلح الأساسي صورة غلاف. بعد ذلك، سيتم حذف المصطلحات المكررة الأخرى.

source: I have backed up my database and understand the risks.
ar: لقد قمت بعمل نسخة احتياطية لقاعدة البيانات الخاصة بي وأدرك المخاطر.

source: Find and Merge Duplicate Compounds
ar: البحث عن الكمبوندات المكررة ودمجها

source: Nonce verification failed. Action aborted.
ar: فشل التحقق من Nonce. تم إلغاء الإجراء.

source: You must confirm that you have backed up your database and understand the risks.
ar: يجب عليك التأكد من أنك قمت بعمل نسخة احتياطية لقاعدة البيانات الخاصة بك وفهم المخاطر.

source: You do not have sufficient permissions to perform this action.
ar: ليس لديك الأذونات الكافية لأداء هذا الإجراء.

source: Merge Process Log:
ar: سجل عملية الدمج:

source: Starting duplicate term check for taxonomy: %s
ar: بدء التحقق من المصطلح المكرر للتصنيف: %s

source: No terms found or an error occurred while fetching terms.
ar: لم يتم العثور على أي مصطلحات أو حدث خطأ أثناء جلب المصطلحات.

source: Found %d terms with the name: "%s"
ar: تم العثور على %d مصطلحًا باسم: "%s"

source: Selected term ID %d as primary because it has a cover image.
ar: تم تحديد المصطلح ID %d باعتباره أساسيًا لأنه يحتوي على صورة غلاف.

source: Designated Term ID %d (Slug: %s) as the primary term to keep.
ar: تم تعيين معرف المصطلح %d (Slug: %s) باعتباره المصطلح الأساسي الذي يجب الاحتفاظ به.

source: Processing duplicate Term ID %d (Slug: %s)...
ar: جاري معالجة معرف المصطلح المكرر %d (Slug: %s)...

source: Failed to add primary term %d to Post ID %d. Error: %s
ar: تعذّرت إضافة المصطلح الأساسي %d إلى مُعرّف المنشور %d. الخطأ: %s

source: Failed to set primary term %d for Post ID %d after reassigning. Error: %s
ar: فشل تعيين المصطلح الأساسي %d لمعرّف المنشور %d بعد إعادة التعيين. الخطأ: %s

source: Reassigned Post ID %d from term %d to primary term %d.
ar: تم إعادة تعيين معرف المنشور %d من المصطلح %d إلى المصطلح الأساسي %d.

source: No posts found associated with this duplicate term.
ar: لم يتم العثور على أي مشاركات مرتبطة بهذا المصطلح المكرر.

source: Transferred cover image (Attachment ID: %s) from duplicate term %d to primary term %d.
ar: تم نقل صورة الغلاف (معرف المرفق: %s) من المصطلح المكرر %d إلى المصطلح الأساسي %d.

source: Attempting to delete the merged (duplicate) terms...
ar: محاولة حذف الشروط المدمجة (المكررة)...

source: Failed to delete term ID %d. Error: %s
ar: فشل حذف معرف المصطلح %d. الخطأ: %s

source: Failed to delete term ID %d (term might not exist or is default).
ar: فشل حذف معرف المصطلح %d (قد لا يكون المصطلح موجودًا أو أنه افتراضي).

source: Successfully deleted term ID %d.
ar: تم حذف معرف المصطلح %d بنجاح.

source: No duplicate terms (by name) found in this taxonomy.
ar: لم يتم العثور على مصطلحات مكررة (حسب الاسم) في هذا التصنيف.

source: Merge process completed. Total duplicate terms (excluding primaries) processed for deletion: %d
ar: اكتملت عملية الدمج. إجمالي المصطلحات المكررة (باستثناء المصطلحات الأساسية) التي تمت معالجتها للحذف: %d

source: Please flush your permalinks by going to Settings > Permalinks and clicking "Save Changes".
ar: يرجى مسح الروابط الدائمة الخاصة بك عن طريق الذهاب إلى الإعدادات > الروابط الدائمة والنقر فوق "حفظ التغييرات".

source: Developer Image
ar: صورة المطور

source: Enter the URL of the developer image or use the "Upload Image" button.
ar: أدخل عنوان URL لصورة المطور أو استخدم زر "تحميل الصورة".

source: developer Image
ar: صورة المطور

source: Main Sidebar
ar: الشريط الجانبي الرئيسي

source: Widgets added here will appear in the sidebar.
ar: ستظهر الأدوات المُضافة هنا في الشريط الجانبي.

source: Company & Zoom Contact Settings
ar: إعدادات جهة اتصال الشركة وZoom

source: Company Phone
ar: هاتف الشركة

source: Company WhatsApp
ar: واتساب الشركة

source: Please enter your company and Zoom contact details below:
ar: الرجاء إدخال تفاصيل شركتك وبيانات الاتصال الخاصة بـ Zoom أدناه:

source: Company Options
ar: اعدادت الشركة

source: Top Articles
ar: افضل المقالات

source: Footer Menu
ar: قائمة التذييل

source: Footer Cities Menu
ar: قائمة المدن في الفوتر

source: Footer Projects Menu
ar: قائمة مشاريع في الفووتر

source: Footer Developers Menu
ar: قائمة المطورين في الفوتر

source: Transients and caches deleted successfully.
ar: تم حذف العناصر المؤقتة والذاكرة المؤقتة بنجاح.

source: Delete Transients
ar: حذف الكاش

source: Welcome to Capital of Business
ar: مرحبا بكم في COB

source: This is the main template file.
ar: هذا هو ملف القالب الرئيسي.

source: Company Name
ar: الشركة المطورة

source: It is simply dummy text (i.e., the focus is on design rather than content) and is used in layout design.
ar: إنه ببساطة نص وهمي (أي التركيز على التصميم بدلاً من المحتوى) ويستخدم في تصميم التخطيط.

source: Egypt, Cairo
ar: مصر، القاهرة

source: Contact Email
ar: البريد الإلكتروني للاتصال

source: Contact Number
ar: رقم الاتصال

source: No results found.
ar: لم يتم العثور على نتائج.

source: landing areas
ar: مناطق الهبوط

source: No cities found.
ar: لم يتم العثور على مدن.

source: Content for 6 October
ar: المحتوى ليوم 6 أكتوبر

source: Content for Sheikh Zayed
ar: محتوى للشيخ زايد

source: Content for Mokattam
ar: محتوى المقطم

source: Content for Nasr City
ar: محتوى مدينة نصر

source: Content for New Heliopolis
ar: محتوى هليوبوليس الجديدة

source: Content for North Coast
ar: المحتوى للساحل الشمالي

source: Call Us
ar: اتصل بنا

source: WhatsApp
ar: واتساب

source: Zoom
ar: زووم

source: Schedule Appointment
ar: تحديد موعد

source: Live Meeting
ar: لقاء مباشر

source: Select Date
ar: حدد التاريخ

source: Sunday
ar: الأحد

source: October
ar: أكتوبر

source: Monday
ar: الاثنين

source: Tuesday
ar: الثلاثاء

source: Wednesday
ar: الأربعاء

source: Thursday
ar: الخميس

source: Friday
ar: الجمعة

source: Saturday
ar: السبت

source: Select Time
ar: حدد الوقت

source: Confirm Booking
ar: تأكيد الحجز

source: Book your meeting now
ar: احجز اجتماعك الآن

source: Enter Phone Number
ar: أدخل رقم الهاتف

source: Create Meeting
ar: إنشاء اجتماع

source: Your Assistant
ar: رسالتك

source: Need Help?
ar: هل تحتاج إلى مساعدة؟

source: Fill in your details and a real estate expert will contact you as soon as possible.
ar: املأ بياناتك و سوف يقوم خبير عقارى بالاتصال بك فى اقرب وقت

source: Your Message
ar: رسالتك

source: Fill in your information and a real estate expert will contact you shortly.
ar: املأ بياناتك و سوف يقوم خبير عقارى بالاتصال بك فى اقرب وقت

source: Your Name
ar: أسمك

source: Office Image
ar: شركة COB

source: Company Logo
ar: شعار COB

source: Pages:
ar: الصفحات:

source: Edit
ar: تحرير

source: There are currently no Developers.
ar: لا يوجد حاليا أي المطورين.

source: Featured Factories
ar: مصانع مميزة

source: Explore the latest real estate projects available
ar: موقع عقار الجديد ينشر أحدث المشاريع العقارية

source: There are no factories currently available.
ar: لا يوجد مصانع متاحة حاليا.

source: Not known
ar: غير معروف

source: Factory price
ar: سعر المصنع

source: L.E.
ar: جنية .

source: Meter
ar: متر

source: Bathrooms
ar: الحمامات

source: Reference number
ar: الرقم المرجعي

source: Delivery in
ar: موعد التسليم

source: About the factory
ar: عن المصنع

source: Search...
ar: بحث ...

source: Search
ar: بحث

source: Join the fastest-growing real estate companies
ar: انضم إلى أسرع الشركات العقارية نمواً

source: We are looking for passionate individuals to join us in our mission. We value flat hierarchies, clear communication, ownership, and complete accountability.
ar: نحن نبحث عن أفراد متحمسين للانضمام إلينا في مهمتنا. نحن نقدر التسلسل الهرمي المسطح والتواصل الواضح والملكية والمساءلة الكاملة.

source: Since publication
ar: منذ النشر

source: View details
ar: عرض التفاصيل

source: There are no qualifications added
ar: لا توجد مؤهلات مضافة

source: There are no tags
ar: لا توجد علامات

source: Apply Now
ar: تقدم بطلبك الآن

source: Full name
ar: الاسم الكامل

source: phone number
ar: رقم التليفون

source: Number of years of experience
ar: عدد سنوات الخبرة

source: E-mail
ar: بريد إلكتروني

source: The address
ar: العنوان

source: Attach the CV
ar: إرفاق السيرة الذاتية

source: Choose the file
ar: اختر الملف

source: Or drag files here
ar: أو اسحب الملفات هنا

source: File type: PDF or PNG
ar: نوع الملف: PDF أو PNG

source: More details
ar: المزيد من التفاصيل

source: Enter any other details.
ar: أدخل أي تفاصيل أخرى.

source: There are no jobs.
ar: لا توجد وظائف.

source: Search by area
ar: البحث حسب المنطقة

source: View all
ar: عرض الكل

source: There are currently no services.
ar: لا يوجد حاليا أي خدمات.

source: Articles.
ar: مقالات.

source: Explore a selection of the latest real estate projects available with us.
ar: استكشف مجموعة مختارة من أحدث المشاريع العقارية المتاحة لدينا.

source: There are no new articles currently.
ar: لا توجد مقالات جديدة حاليا.

source: Most Searched Compounds
ar: الكمبوندات الأكثر بحثا

source: No compounds available at the moment.
ar: لا توجد مركبات متاحة في الوقت الراهن.

source: Latest Factories
ar: أحدث المصانع

source: Discover the latest factories and advanced technologies that meet the needs of the modern industrial market
ar: اكتشف أحدث المصانع والتقنيات المتقدمة التي تلبي احتياجات السوق الصناعية الحديثة

source: Default Slide
ar: الشريحة الافتراضية

source: Find your property
ar: ابحث عن وحدتك

source: Search by compound, location, real estate
ar: البحث عن طريق الكلمات الرئيسية والموقع او العقار

source: Select Property Type
ar: اختر نوع العقار

source: Bedrooms
ar: غرف نوم

source: Price
ar: السعر

source: Detailed search
ar: بحث مفصل

source: Search by keywords, location, real estate photos
ar: البحث عن طريق الكلمات الرئيسية والموقع والصور العقارية

source: No results found
ar: لم يتم العثور على نتائج.

source: Explore a selection of our latest available real estate projects
ar: استكشف مجموعة مختارة من أحدث مشاريعنا العقارية المتاحة
