Repository: waleedelsefy/cob
Catalog: languages/*.po
Languages: ar

source: No projects available at the moment.
ar: لا توجد عقارات متاحة في الوقت الراهن.

source: Featured Properties
ar: عقارات مميزة

source: View All
ar: عرض الكل

source: No properties available at the moment.
ar: لا توجد عقارات متاحة في الوقت الراهن.

source: Legal services
ar: الخدمات القانونية

source: We provide a variety of legal services to meet our clients' needs
ar: نحن نقدم مجموعة متنوعة من الخدمات القانونية لتلبية احتياجات عملائنا

source: There are currently no services in this language.
ar: لا توجد خدمات بهذه اللغة حاليًا.

source: There are no lands currently available.
ar: لا توجد أراضي متاحة حاليًا.

source: Meter
ar: متر

source: Bathrooms
ar: الحمامات

source: Reference number
ar: الرقم المرجعي

source: Delivery in
ar: موعد التسليم

source: Participant Email
ar: البريد الإلكتروني للاتصال

source: Please wait...
ar: انتظر من فضلك...

source: Your Meeting Link
ar: رابط اجتماعك

source: Copy
ar: نسخ

source: Add to Google Calendar
ar: أضف إلى تقويم جوجل

source: Copied!
ar: منسوخ!

source: Could not shorten URL. Showing original.
ar: تعذّر اختصار الرابط. يُعرض الأصل.

source: An error occurred.
ar: حدث خطأ.

source: Please try again.
ar: يرجى المحاولة مرة أخرى.

source: About the land
ar: عن الأرض

source: Prices start
ar: السعر يبدء

source: From
ar: من

source: To
ar: الي

source: Rooms
ar: غرف

source: Image of %s - 1
ar: صورة %s - 1

source: Image of %s - 2
ar: صورة %s - 2

source: Image of %s - 3
ar: صورة %s - 3

source: Image of %s - 4
ar: صورة %s - 4

source: Image of %s - 5
ar: صورة %s - 5

source: Image of %s - 6
ar: صورة %s - 6

source: Image of %s - 7
ar: صورة %s - 7

source: Thumbnail for %s
ar: صورة مصغرة لـ %s

source: Water Games
ar: العاب مائية

source: Security
ar: أمن وحراسه

source: Sports Clubs
ar: أندية اجتماعية

source: Electronic Gates
ar: البوابات الإلكترونية

source: Car Garages
ar: جراج

source: Maintenance and Cleaning
ar: خدمات الصيانة والنظافة

source: Internet Networks
ar: انترنت

source: Cafes and Restaurants
ar: مطاعم وكافيهات

source: Kids Area
ar: منطقة اطفال

source: Shopping Center
ar: مركز تجاري

source: Green Spaces
ar: مساحات خضراء

source: Cycling Lanes
ar: مسارات دراجات

source: Power Generators
ar: مولدات الطاقة

source: Facilities and services
ar: المرافق والخدمات

source: Payment systems
ar: أنظمة السداد

source: Deposit
ar: مقدم

source: Years
ar: سنين

source: About the property
ar: عن العقار

source: The most searched compounds in %s
ar: الكمبوندات الأكثر بحثًا في %s

source: Services provided
ar: الخدمات المقدمة

source: There are no services currently available.
ar: لا توجد خدمات متاحة حاليا.

source: Our Experts
ar: خبراؤنا

source: services1
ar: الخدمات1

source: Image 2
ar: الصورة 2

source: Latest Posts
ar: أحدث المشاركات

source: No posts found.
ar: لم يتم العثور على أي مشاركات.

source: Articles
ar: المقالات

source: Explore a selection of the latest real estate projects available with us
ar: استكشف مجموعة مختارة من أحدث المشاريع العقارية المتاحة لدينا

source: There are no articles currently available.
ar: لا توجد مقالات متاحة حاليا.

source: Default Image
ar: الصورة الافتراضية

source: EGP
ar: ج.م.

source: Down Payment:
ar: دفعة مبدئية:

source: Top 5 Open Compounds
ar: افضل كمبوندات

source: No open compounds available.
ar: لا توجد كموبوندات مفتوحة الان

source: The most important compounds %s
ar: أهم المشروعات %s

source: Visits
ar: الزيارات

source: No projects available
ar: لا توجد مشاريع متاحة

source: Default Image 1
ar: الصورة الافتراضية 1

source: Default Image 2
ar: الصورة الافتراضية 2

source: %d Results
ar: %d نتائج

source: Discover %s Units
ar: اكتشف %s وحدات

source: results
ar: نتائج

source: Sort By
ar: فرز حسب

source: Price: Low to High
ar: السعر: من الأقل إلى الأعلى

source: Price: High to Low
ar: السعر: من الأعلى إلى الأدنى

source: Date: Oldest
ar: التاريخ: الأقدم

source: Date: Newest
ar: التاريخ: الأحدث

source: Image 1
ar: الصورة 1

source: Featured projects
ar: مشاروعات مميزة

source: No projects available.
ar: لا توجد مشاريع متاحة.

source: No articles selected.
ar: أحدث الأخبار.

source: Capital of Business is a premium, responsive WordPress theme designed specifically for real estate businesses. Built with Bootstrap and optimized for PHP 8.2, it offers seamless performance and a sleek user experience. Featuring advanced search filters, interactive maps, and customizable property listings, the theme enables real estate agencies, developers, and agents to showcase properties effectively. Its powerful admin panel allows for effortless customization, making it the ideal choice for professionals looking to enhance their online presence with a modern, feature-rich website.
ar: Capital of Business عبارة عن سمة WordPress متميزة وسريعة الاستجابة مصممة خصيصًا للشركات العقارية. تم تصميمه باستخدام Bootstrap وتم تحسينه لـ PHP 8.2، وهو يوفر أداءً سلسًا وتجربة مستخدم أنيقة. يتميز هذا الموضوع بمرشحات بحث متقدمة وخرائط تفاعلية وقوائم عقارات قابلة للتخصيص، مما يتيح للوكالات العقارية والمطورين والوكلاء عرض العقارات بفعالية. تتيح لوحة الإدارة القوية إمكانية التخصيص بسهولة، مما يجعلها الخيار الأمثل للمحترفين الذين يتطلعون إلى تعزيز تواجدهم عبر الإنترنت من خلال موقع ويب حديث وغني بالميزات.

source: Waleed Elsefy
ar: وليد الصيفي

source: Single Project
ar: الكمبوند

source: single post
ar: المقالة
