<div class="first-writer">
    <div class="container">
        <div class="right-writer">
            <ul>
                <li>
                    <?php
                    $author_id = get_the_author_meta('ID');
                    $author_avatar = get_avatar_url( $author_id, array( 'size' => 96 ) );
                    if ( $author_avatar ) {
                        echo '<img src="' . esc_url( $author_avatar ) . '" alt="writer" class="lazyload">';
                    } else {
                        echo '<img src="' . esc_url( get_template_directory_uri() . '/assets/imgs/default-author.jpg' ) . '" alt="default writer" class="lazyload">';
                    }
                    ?>


                </li>
                <li><svg width="16" height="17" viewBox="0 0 16 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M13.1174 0.735352C12.7787 0.735352 12.4398 0.864728 12.1813 1.12323L10.5833 2.7213L13.8932 6.03121L15.4913 4.43314C16.0083 3.91613 16.0083 3.07798 15.4913 2.56097L14.0535 1.12323C13.795 0.864728 13.4562 0.735352 13.1174 0.735352ZM9.25928 4.04526L1.48739 11.8171C1.48739 11.8171 2.09494 11.7627 2.32134 11.989C2.54774 12.2154 2.36137 13.697 2.6394 13.975C2.91744 14.253 4.38963 14.0573 4.6008 14.2685C4.81198 14.4797 4.79733 15.127 4.79733 15.127L12.5692 7.35517L9.25928 4.04526ZM0.653442 13.975L0.0289505 15.7437C0.00440052 15.8135 -0.00827362 15.887 -0.00854492 15.9609C-0.00854492 16.1365 0.0612 16.3049 0.185347 16.429C0.309493 16.5532 0.477872 16.6229 0.653442 16.6229C0.727434 16.6227 0.800857 16.61 0.870657 16.5854C0.872817 16.5846 0.874972 16.5837 0.877122 16.5828L0.89393 16.5777L0.897809 16.5751L2.6394 15.9609L1.64642 14.968L0.653442 13.975Z"
                            fill="black" />
                    </svg><span><?php echo get_the_author_meta( 'display_name' )?></span>
                </li>
                <li><svg width="19" height="20" viewBox="0 0 19 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M9.05826 0.924805C4.04927 0.924805 -0.00854492 4.99134 -0.00854492 10.0003C-0.00854492 15.0093 4.04927 19.0759 9.05826 19.0759C14.076 19.0759 18.1425 15.0093 18.1425 10.0003C18.1425 4.99134 14.076 0.924805 9.05826 0.924805ZM9.06699 17.2608C5.05717 17.2608 1.80656 14.0102 1.80656 10.0003C1.80656 5.99052 5.05717 2.73991 9.06699 2.73991C13.0768 2.73991 16.3274 5.99052 16.3274 10.0003C16.3274 14.0102 13.0768 17.2608 9.06699 17.2608Z"
                            fill="#20201E" />
                        <path
                            d="M9.52051 5.46191H8.15918V10.9072L12.9238 13.7652L13.6045 12.6482L9.52051 10.2266V5.46191Z"
                            fill="#20201E" />
                    </svg>
                    <span><?php
                        $timestamp = get_the_date('U');

                        $formatter = new IntlDateFormatter(
                            'ar_EG',
                            IntlDateFormatter::FULL,
                            IntlDateFormatter::SHORT,
                            'Africa/Cairo',
                            IntlDateFormatter::GREGORIAN,
                            'EEEE d MMMM yyyy - h:mm a'
                        );

                        // طباعة التاريخ بعد التنسيق
                        echo $formatter->format($timestamp);
                        ?>
</span>
                </li>
            </ul>
        </div>
        <div class="left-writer">
            <div class="share">
                <a href=""><svg width="41" height="41" viewBox="0 0 41 41" fill="none"
                                xmlns="http://www.w3.org/2000/svg">
                        <rect x="0.878906" y="0.5" width="40" height="40" rx="20" fill="#EC3C43" />
                        <path
                            d="M29.2716 16.5317L27.5246 15.0146C26.266 13.9215 25.7726 13.3335 25.091 13.5414C24.2411 13.8006 24.5209 15.4361 24.5209 15.9882C23.1995 15.9882 21.8257 15.8866 20.5232 16.0984C16.2234 16.7974 14.8789 19.8566 14.8789 23.1525C16.0959 22.4065 17.3116 21.5746 18.7743 21.2289C20.6001 20.7973 22.6392 21.0032 24.5209 21.0032C24.5209 21.5554 24.2411 23.1909 25.091 23.4501C25.8633 23.6856 26.266 23.0699 27.5246 21.9769L29.2716 20.4598C30.3431 19.5293 30.8789 19.064 30.8789 18.4957C30.8789 17.9275 30.3431 17.4622 29.2716 16.5317Z"
                            stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
                        <path
                            d="M19.4465 11.5C15.5863 11.5069 13.5648 11.6015 12.273 12.8907C10.8789 14.282 10.8789 16.5212 10.8789 20.9997C10.8789 25.4782 10.8789 27.7174 12.273 29.1087C13.6671 30.5 15.9109 30.5 20.3984 30.5C24.886 30.5 27.1298 30.5 28.5239 29.1087C29.4945 28.14 29.7893 26.7603 29.8789 24.5"
                            stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
                    </svg>مشاركة
                </a>
            </div>
            <div class="social-writer">
                <ul>
                    <li><svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M5.87939 10.2002V19.9993" stroke="black" stroke-width="2.0998"
                                  stroke-linecap="round" stroke-linejoin="round" />
                            <path
                                d="M11.479 14.3998V19.9993M11.479 14.3998C11.479 12.0804 13.3592 10.2002 15.6786 10.2002C17.998 10.2002 19.8782 12.0804 19.8782 14.3998V19.9993M11.479 14.3998V10.2002"
                                stroke="black" stroke-width="2.0998" stroke-linecap="round" stroke-linejoin="round" />
                            <path d="M5.891 6.00098H5.87842" stroke="black" stroke-width="2.79973"
                                  stroke-linecap="round" stroke-linejoin="round" />
                        </svg>
                    </li>
                    <li><svg width="17" height="18" viewBox="0 0 17 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M1.87939 16L7.75042 10.1291M7.75042 10.1291L1.87939 2H5.76829L10.0085 7.87091M7.75042 10.1291L11.9905 16H15.8794L10.0085 7.87091M15.8794 2L10.0085 7.87091"
                                stroke="black" stroke-width="2.1" stroke-linecap="round" stroke-linejoin="round" />
                        </svg>
                    </li>
                    <li><svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M3.01318 13.0002C3.01318 8.34957 3.01318 6.02427 4.45793 4.57951C5.90269 3.13477 8.22798 3.13477 12.8786 3.13477C17.5291 3.13477 19.8544 3.13477 21.2992 4.57951C22.744 6.02427 22.744 8.34957 22.744 13.0002C22.744 17.6507 22.744 19.976 21.2992 21.4208C19.8544 22.8655 17.5291 22.8655 12.8786 22.8655C8.22798 22.8655 5.90269 22.8655 4.45793 21.4208C3.01318 19.976 3.01318 17.6507 3.01318 13.0002Z"
                                stroke="black" stroke-width="1.38462" stroke-linejoin="round" />
                            <path
                                d="M17.5517 12.9992C17.5517 15.5801 15.4595 17.6723 12.8786 17.6723C10.2978 17.6723 8.20557 15.5801 8.20557 12.9992C8.20557 10.4184 10.2978 8.32617 12.8786 8.32617C15.4595 8.32617 17.5517 10.4184 17.5517 12.9992Z"
                                stroke="black" stroke-width="1.55769" />
                            <path d="M18.5987 7.28809H18.5894" stroke="black" stroke-width="2.07692"
                                  stroke-linecap="round" stroke-linejoin="round" />
                        </svg>
                    </li>
                    <li><svg width="16" height="22" viewBox="0 0 16 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill-rule="evenodd" clip-rule="evenodd"
                                  d="M2.06121 9.48174C1.08345 9.48174 0.879395 9.67364 0.879395 10.5928V12.2595C0.879395 13.1788 1.08345 13.3706 2.06121 13.3706H4.42484V20.0373C4.42484 20.9565 4.6289 21.1484 5.60666 21.1484H7.97029C8.94809 21.1484 9.15209 20.9565 9.15209 20.0373V13.3706H11.8061C12.5477 13.3706 12.7388 13.2351 12.9425 12.5648L13.449 10.8981C13.7979 9.74984 13.5829 9.48174 12.3126 9.48174H9.15209V6.704C9.15209 6.09035 9.68119 5.59288 10.3339 5.59288H13.6976C14.6753 5.59288 14.8794 5.40103 14.8794 4.48177V2.25955C14.8794 1.34029 14.6753 1.14844 13.6976 1.14844H10.3339C7.07039 1.14844 4.42484 3.63575 4.42484 6.704V9.48174H2.06121Z"
                                  stroke="black" stroke-width="1.5" stroke-linejoin="round" />
                        </svg>
                    </li>
                </ul>
            </div>
        </div>
    </div>
</div>
